# YOLOv13-P2-ECA-WFF Configuration
# 改进内容：
# 1. 在Backbone Stage1(P2层)和Stage2(P3层)后添加ECA轻量注意力模块
# 2. 优化Neck高分辨率融合，使用WeightedFeatureFusion替代简单Concat
# 3. P2层轻量化优化：通道数64，减少计算量
# 4. 保持与原始YOLOv13-P2-Light的兼容性

nc: 10  # number of classes (10-class sonar dataset)
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,    [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv,    [128, 3, 2, 1, 2]]    # 1-P2/4 (Stage1)
  - [-1, 2, DSC3k2,  [256, False, 0.25]]   # 2
  - [-1, 1, ECA,     [256]]                # 3-ECA attention for Stage1 (小目标特征增强)
  - [-1, 1, Conv,    [256, 3, 2, 1, 4]]    # 4-P3/8 (Stage2)
  - [-1, 2, DSC3k2,  [512, False, 0.25]]   # 5
  - [-1, 1, ECA,     [512]]                # 6-ECA attention for Stage2 (中小目标特征增强)
  - [-1, 1, DSConv,  [512, 3, 2]]          # 7-P4/16
  - [-1, 4, A2C2f,   [512, True, 4]]       # 8
  - [-1, 1, DSConv,  [1024, 3, 2]]         # 9-P5/32
  - [-1, 4, A2C2f,   [1024, True, 1]]      # 10

head:
  # HyperACE cross-scale attention (P3, P4, P5)
  - [[5, 8, 10], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]]  # 11
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                       # 12
  - [11, 1, DownsampleConv, []]                                      # 13
  - [[8, 11],  1, FullPAD_Tunnel, []]   # 14
  - [[5, 12], 1, FullPAD_Tunnel, []]    # 15
  - [[10, 13], 1, FullPAD_Tunnel, []]   # 16

  # P4 fusion
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 17
  - [[-1, 14], 1, Concat, [1]]                   # 18 cat P4
  - [-1, 1, DSC3k2, [512, True]]                 # 19
  - [[-1, 11], 1, FullPAD_Tunnel, []]            # 20

  # P3 fusion
  - [19, 1, nn.Upsample, [None, 2, "nearest"]]   # 21
  - [[-1, 15], 1, Concat, [1]]                   # 22 cat P3
  - [-1, 1, DSC3k2, [256, True]]                 # 23
  - [12, 1, Conv, [256, 1, 1]]                   # 24
  - [[23, 24], 1, FullPAD_Tunnel, []]            # 25

  # P2 fusion (lightweight with weighted feature fusion)
  - [23, 1, nn.Upsample, [None, 2, "nearest"]]   # 26 upsample P3→P2 (256通道)
  - [2, 1, Conv, [256, 1, 1]]                    # 27 adjust backbone P2 to 256 channels (索引2是DSC3k2输出256通道)
  - [[26, 27], 1, WeightedFeatureFusion, [2, 'sum']]  # 28 加权融合P3上采样和P2特征 (256通道)
  - [-1, 1, DSC3k2, [64, True]]                  # 29 (P2/4-xsmall) 轻量化处理，降到64通道

  # P3 output (downsample from P2)
  - [-1, 1, DSConv, [256, 3, 2]]                 # 30
  - [[30, 25], 1, WeightedFeatureFusion, [2, 'sum']]  # 31 加权融合下采样P2和P3
  - [-1, 1, DSC3k2, [256, True]]                 # 32 (P3)
  - [[-1, 24], 1, FullPAD_Tunnel, []]            # 33

  # P4 output
  - [32, 1, DSConv, [512, 3, 2]]                 # 34
  - [[-1, 20], 1, Concat, [1]]                   # 35 cat head P4
  - [-1, 1, DSC3k2, [512, True]]                 # 36 (P4)
  - [[-1, 14], 1, FullPAD_Tunnel, []]            # 37

  # P5 output
  - [36, 1, DSConv, [512, 3, 2]]                 # 38
  - [[-1, 16], 1, Concat, [1]]                   # 39 cat head P5
  - [-1, 1, DSC3k2, [1024, True]]                # 40 (P5)
  - [[-1, 13], 1, FullPAD_Tunnel, []]            # 41

  - [[29, 33, 37, 41], 1, Detect, [nc]]          # Detect(P2, P3, P4, P5)
